% Параметры
l = 1;    % Длина маятника (м)
m = 1;    % Масса (кг)
g = 9.81; % Ускорение свободного падения (м/с²)
F = 30;  % Постоянная касательная сила (Н)
k = 0.1; % Трение оси
alpha = deg2rad(45);

% Начальные условия
O0 = 0;    % Начальный угол (30°)
omega0 = 0;   % Начальная угловая скорость
integral0 = 0;
Y0 = [O0; omega0; integral0];

% Временной интервал
tspan = [0 10];

% Решение уравнения
[t, Y] = ode45(@(t, Y) pendulumODE(t, Y, l, m, g, F, k, alpha, 10, 01, 2), tspan, Y0);

% Графики
figure(1);
clf(figure(1))

subplot(2,1,1);
plot(t, rad2deg(Y(:,1)), 'r', 'LineWidth', 1.5);
xlabel('Время (с)');
ylabel('Угол O (град)');
title('Динамика угла');

subplot(2,1,2);
plot(t, Y(:,2), 'b', 'LineWidth', 1.5);
xlabel('Время (с)');
ylabel('Угловая скорость ω (рад/с)');
title('Динамика угловой скорости');